profile_jp.org
#+TITLE:     深井貴明(Takaaki FUKAI)
#+AUTHOR:    深井貴明
#+EMAIL:     fukai (at) aist.go.jp
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  jp
#+OPTIONS:   H:1 num:nil toc:t \n:n @:t ::t |:t ^:t -:t f:t *:t <:nil
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_FILE_NAME: ./docs/profile_jp.html
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
English version is [[./profile_en.html][here]]
* 所属
  - [[https://www.ipri.aist.go.jp/][国立研究開発法人 産業技術総合研究所 インテリジェントプラットフォーム研究部門]]
  - 主任研究員

* 連絡先
  - メールアドレス :: takaaki.fukai (at) aist.go.jp
  - 住所 :: 〒135-0064 東京都江東区青海2-3-26

* 研究分野
  - 軽量ハイパバイザ
    - [[https://www.bitvisor.org/][BitVisor]]
    - [[https://github.com/RIKEN-RCCS/MilvusVisor][MilvusVisor]]
  - コンピュータセキュリティ
    - 機密 VM (Confidential VM)
    - システムソフトウェアの脆弱性発見
  - データセンタ管理技術
    - クラウドにおけるベアメタルインスタンス管理技術
    - ユーザーが管理者権限を利用可能な HPC システム

* 学歴
  - 2018年9月 筑波大学 システム情報工学研究科 「博士(工学)」 取得 (筑波大学) (博乙第2892号)
  - 2018年3月 筑波大学大学院 博士後期課程システム情報工学研究科 コンピュータサイエンス専攻 退学
  - 2015年4月 筑波大学大学院 博士後期課程システム情報工学研究科 コンピュータサイエンス専攻 入学
  - 2015年3月 筑波大学大学院 博士前期課程システム情報工学研究科 コンピュータサイエンス専攻 卒業
  - 2013年4月 筑波大学大学院 博士前期課程システム情報工学研究科 コンピュータサイエンス専攻 入学
  - 2013年3月 岡山大学工学部情報工学科 卒業
  - 2009年4月 岡山大学工学部情報工学科 入学
  - 2009年3月 徳島県立穴吹高等学校 卒業

* 職歴
- 2025年10月--現在: 産業技術総合研究所 インテリジェントプラットフォーム研究部門 主任研究員
- 2025年3月--2025年9月: 産業技術総合研究所 インテリジェントプラットフォーム研究部門 研究員
- 2022年1月--2025年3月: 産業技術総合研究所 デジタルアーキテクチャ研究センター 研究員
- 2020年1月--2022年3月: 理化学研究所 計算科学研究センター 特別研究員
  - 高性能計算機 (HPC) 環境での機械学習の I/O 性能に関する研究に従事
- 2018年4月--2019年12月: 日本アイ・ビー・エム株式会社 製品開発エンジニア
  - Web アプリケーションのQA, クラウド製品の DevOps 業務に従事
  - 業務経験: ソフトウェアテスト, CI/CD, Jenkins, Docker, Kubernetes, Helm

* COMMENT 研究テーマ
  物理マシン間のライブマイグレーション

* 業績
** 論文誌
   1. Takahiro Hirofuchi, Akram Ben Ahmed, _Takaaki Fukai_.
      *Implementation and Evaluation of a Time-Sensitive Networking Endpoint for Asynchronous Traffic Shaping.*
      IEEE Access,
      Feb. 2026.
      (Open Access: https://ieeexplore.ieee.org/document/11372664)
   2. Akram Ben Ahmed, Takahiro Hirofuchi, _Takaaki Fukai_.
      *Hardware Design and Evaluation of an FPGA-Based Network Switch Supporting Asynchronous Traffic Shaping for Time Sensitive Networking.*
      IEEE Access,
      Aug. 2024.
      (Open Access: https://ieeexplore.ieee.org/document/10658978)
   3. _Takaaki Fukai_, Takahiro Shinagawa, Kazuhiko Kato.
      *Live Migration in Bare-metal Clouds.*
      IEEE Transactions on Cloud Computing,
      Jul 2018.
      (Open Access: https://ieeexplore.ieee.org/document/8401692)

** 国際会議
   1. Reima Ishii, _Takaaki Fukai_, Takahiro Shinagawa.
      *NecoFuzz: Effective Fuzzing of Nested Virtualization via Fuzz-Harness Virtual Machines.*
      In Proceedings of the 2026 European Conference on Computer Systems (EuroSys 2026).
      (To appear)
   2. Satoru Takekoshi, Manami Mori, _Takaaki Fukai_, Takahiro Shinagawa.
      *BadAML: Exploiting Legacy Firmware Interfaces to Compromise Confidential Virtual Machines.*
      Proceedings of the 2025 ACM SIGSAC Conference on Computer and Communications Security (CCS 2025),
      Oct. 2025.
      *[Distinguished Paper Award]*.
   3. Akram Ben Ahmed, Takahiro Hirofuchi, _Takaaki Fukai_.
      *EFCC: Ethernet Frame Crafter & Capture for TSN Research.*
      2025 IEEE 50th Conference on Local Computer Networks (LCN),
      Oct. 2025.
   4. Itsuki Nakai, _Takaaki Fukai_, Takahiro Hirofuchi, Yukinori Sato.
      *Comprehensive Performance Evaluation of Microservices on Confidential Containers in Mutli-access Edge Computing Environments.*
      2025 IEEE International Conference on Cloud Engineering (IC2E),
      Sep. 2025.
   5. Akram BEN Ahmed, Takahiro Hirofuchi, _Takaaki Fukai_.
      *FPGA-Based Network Switch Architecture Supporting Credit Based Shaper for Time Sensitive Networks.*
      2024 IEEE 29th International Conference on Emerging Technologies and Factory Automation (ETFA),
      Sep. 2024.
   6. _Takaaki Fukai_, Kento Sato and Takahiro Hirofuchi.
      *Analyzing I/O Performance of a Hierarchical HPC Storage System for Distributed Deep Learning*
      In Proceedings of the 23rd International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT’22)
      Dec 2022.

   7. Tabuchi, Akihiro and Shirahata, Koichi and Yamazaki, Masafumi and Kasagi, Akihiko and Honda, Takumi and Kurihara, Kouji and Kawakami, Kentaro and Tabaru, Tsuguchika and Fukumoto, Naoto and Kuroda, Akiyoshi and _Fukai, Takaaki_ and Sato, Kento
      *The 16,384-node Parallelism of 3D-CNN Training on An Arm CPU based Supercomputer*
      2021 IEEE 28th International Conference on High Performance Computing, Data, and Analytics (HiPC)
      Dec. 2021.

   8. Masanori Misono, Masahiro Ogino, _Takaaki Fukai_, Takahiro Shinagawa.
      *FaultVisor2: Testing Hypervisor Device Drivers against Real Hardware Failures.*
      In Proceedings of the 10th IEEE International Conference on Cloud Computing Technology and Science (CloudCom 2018),
      Dec. 2018. (Acceptance Ratio: 19.8%) *[Best paper award]*.

   9. Iori Yoneji, _Takaaki Fukai_, Takahiro Shinagawa and Kazuhiko Kato.
      *Unified Hardware Abstraction Layer with Device Masquerade.*
      In Proceedings of the 33rd ACM Symposium On Applied Computing (ACM SAC 2018), 
      Apr. 2018 (To appear).

   10. _Takaaki Fukai_, Satoru Takekoshi, Kohei Azuma, Takahiro Shinagawa and Kazuhiko Kato.
       *BMCArmor: A Hardware Protection Scheme for Bare-Metal Clouds.*
       In Proceedings of the 9th IEEE International Conference on Cloud Computing Technology and Science (CloudCom 2017),
       Dec. 2017.

   11. _Takaaki Fukai_, Yushi Omote, Takahiro Shinagawa, and Kazuhiko Kato.
       *OS-Independent Live Migration Scheme for Bare-metal Clouds.*
       In Proceedings of the 8th IEEE/ACM International Conference on Utility and Cloud Computing (UCC 2015), 
       Dec. 2015.
       *[Best paper award]*.

