docs/profile_jp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2026-03-09 Mon 21:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>深井貴明(Takaaki FUKAI)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="深井貴明" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">深井貴明(Takaaki FUKAI)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2138542">所属</a></li>
<li><a href="#org64f5744">連絡先</a></li>
<li><a href="#orge9ca9b7">研究分野</a></li>
<li><a href="#orgfbc5cdf">学歴</a></li>
<li><a href="#org50ddfaf">職歴</a></li>
<li><a href="#orgd89bc34">業績</a></li>
<li><a href="#orgc918bdb">受賞歴</a></li>
<li><a href="#orge8b5ba5">研究資金獲得歴</a></li>
<li><a href="#orgb81a2b2">学会活動</a></li>
<li><a href="#org3b9852c">その他学外活動</a></li>
<li><a href="#orga72eae0">更新履歴</a></li>
</ul>
</div>
</div>
<p>
English version is <a href="./profile_en.html">here</a><br />
</p>
<div id="outline-container-org2138542" class="outline-2">
<h2 id="org2138542">所属</h2>
<div class="outline-text-2" id="text-org2138542">
<ul class="org-ul">
<li><a href="https://www.ipri.aist.go.jp/">国立研究開発法人 産業技術総合研究所 インテリジェントプラットフォーム研究部門</a><br /></li>
<li>主任研究員<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org64f5744" class="outline-2">
<h2 id="org64f5744">連絡先</h2>
<div class="outline-text-2" id="text-org64f5744">
<dl class="org-dl">
<dt>メールアドレス</dt><dd>takaaki.fukai (at) aist.go.jp<br /></dd>
<dt>住所</dt><dd>〒135-0064 東京都江東区青海2-3-26<br /></dd>
</dl>
</div>
</div>

<div id="outline-container-orge9ca9b7" class="outline-2">
<h2 id="orge9ca9b7">研究分野</h2>
<div class="outline-text-2" id="text-orge9ca9b7">
<ul class="org-ul">
<li>軽量ハイパバイザ<br />
<ul class="org-ul">
<li><a href="https://www.bitvisor.org/">BitVisor</a><br /></li>
<li><a href="https://github.com/RIKEN-RCCS/MilvusVisor">MilvusVisor</a><br /></li>
</ul></li>
<li>コンピュータセキュリティ<br />
<ul class="org-ul">
<li>機密 VM (Confidential VM)<br /></li>
<li>システムソフトウェアの脆弱性発見<br /></li>
</ul></li>
<li>データセンタ管理技術<br />
<ul class="org-ul">
<li>クラウドにおけるベアメタルインスタンス管理技術<br /></li>
<li>ユーザーが管理者権限を利用可能な HPC システム<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfbc5cdf" class="outline-2">
<h2 id="orgfbc5cdf">学歴</h2>
<div class="outline-text-2" id="text-orgfbc5cdf">
<ul class="org-ul">
<li>2018年9月 筑波大学 システム情報工学研究科 「博士(工学)」 取得 (筑波大学) (博乙第2892号)<br /></li>
<li>2018年3月 筑波大学大学院 博士後期課程システム情報工学研究科 コンピュータサイエンス専攻 退学<br /></li>
<li>2015年4月 筑波大学大学院 博士後期課程システム情報工学研究科 コンピュータサイエンス専攻 入学<br /></li>
<li>2015年3月 筑波大学大学院 博士前期課程システム情報工学研究科 コンピュータサイエンス専攻 卒業<br /></li>
<li>2013年4月 筑波大学大学院 博士前期課程システム情報工学研究科 コンピュータサイエンス専攻 入学<br /></li>
<li>2013年3月 岡山大学工学部情報工学科 卒業<br /></li>
<li>2009年4月 岡山大学工学部情報工学科 入学<br /></li>
<li>2009年3月 徳島県立穴吹高等学校 卒業<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org50ddfaf" class="outline-2">
<h2 id="org50ddfaf">職歴</h2>
<div class="outline-text-2" id="text-org50ddfaf">
<ul class="org-ul">
<li>2025年10月&#x2013;現在: 産業技術総合研究所 インテリジェントプラットフォーム研究部門 主任研究員<br /></li>
<li>2025年3月&#x2013;2025年9月: 産業技術総合研究所 インテリジェントプラットフォーム研究部門 研究員<br /></li>
<li>2022年1月&#x2013;2025年3月: 産業技術総合研究所 デジタルアーキテクチャ研究センター 研究員<br /></li>
<li>2020年1月&#x2013;2022年3月: 理化学研究所 計算科学研究センター 特別研究員<br />
<ul class="org-ul">
<li>高性能計算機 (HPC) 環境での機械学習の I/O 性能に関する研究に従事<br /></li>
</ul></li>
<li>2018年4月&#x2013;2019年12月: 日本アイ・ビー・エム株式会社 製品開発エンジニア<br />
<ul class="org-ul">
<li>Web アプリケーションのQA, クラウド製品の DevOps 業務に従事<br /></li>
<li>業務経験: ソフトウェアテスト, CI/CD, Jenkins, Docker, Kubernetes, Helm<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd89bc34" class="outline-2">
<h2 id="orgd89bc34">業績</h2>
<div class="outline-text-2" id="text-orgd89bc34">
</div>
<ul class="org-ul">
<li><a id="orgef9e315"></a>論文誌<br />
<div class="outline-text-3" id="text-orgef9e315">
<ol class="org-ol">
<li>Takahiro Hirofuchi, Akram Ben Ahmed, <span class="underline">Takaaki Fukai</span>.<br />
<b>Implementation and Evaluation of a Time-Sensitive Networking Endpoint for Asynchronous Traffic Shaping.</b><br />
IEEE Access,<br />
Feb. 2026.<br />
(Open Access: <a href="https://ieeexplore.ieee.org/document/11372664">https://ieeexplore.ieee.org/document/11372664</a>)<br /></li>
<li>Akram Ben Ahmed, Takahiro Hirofuchi, <span class="underline">Takaaki Fukai</span>.<br />
<b>Hardware Design and Evaluation of an FPGA-Based Network Switch Supporting Asynchronous Traffic Shaping for Time Sensitive Networking.</b><br />
IEEE Access,<br />
Aug. 2024.<br />
(Open Access: <a href="https://ieeexplore.ieee.org/document/10658978">https://ieeexplore.ieee.org/document/10658978</a>)<br /></li>
<li><span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa, Kazuhiko Kato.<br />
<b>Live Migration in Bare-metal Clouds.</b><br />
IEEE Transactions on Cloud Computing,<br />
Jul 2018.<br />
(Open Access: <a href="https://ieeexplore.ieee.org/document/8401692">https://ieeexplore.ieee.org/document/8401692</a>)<br /></li>
</ol>
</div>
</li>

<li><a id="orgdad35b4"></a>国際会議<br />
<div class="outline-text-3" id="text-orgdad35b4">
<ol class="org-ol">
<li>Reima Ishii, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>NecoFuzz: Effective Fuzzing of Nested Virtualization via Fuzz-Harness Virtual Machines.</b><br />
In Proceedings of the 2026 European Conference on Computer Systems (EuroSys 2026).<br />
(To appear)<br /></li>
<li>Satoru Takekoshi, Manami Mori, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>BadAML: Exploiting Legacy Firmware Interfaces to Compromise Confidential Virtual Machines.</b><br />
Proceedings of the 2025 ACM SIGSAC Conference on Computer and Communications Security (CCS 2025),<br />
Oct. 2025.<br />
<b>[Distinguished Paper Award]</b>.<br /></li>
<li>Akram Ben Ahmed, Takahiro Hirofuchi, <span class="underline">Takaaki Fukai</span>.<br />
<b>EFCC: Ethernet Frame Crafter &amp; Capture for TSN Research.</b><br />
2025 IEEE 50th Conference on Local Computer Networks (LCN),<br />
Oct. 2025.<br /></li>
<li>Itsuki Nakai, <span class="underline">Takaaki Fukai</span>, Takahiro Hirofuchi, Yukinori Sato.<br />
<b>Comprehensive Performance Evaluation of Microservices on Confidential Containers in Mutli-access Edge Computing Environments.</b><br />
2025 IEEE International Conference on Cloud Engineering (IC2E),<br />
Sep. 2025.<br /></li>
<li>Akram BEN Ahmed, Takahiro Hirofuchi, <span class="underline">Takaaki Fukai</span>.<br />
<b>FPGA-Based Network Switch Architecture Supporting Credit Based Shaper for Time Sensitive Networks.</b><br />
2024 IEEE 29th International Conference on Emerging Technologies and Factory Automation (ETFA),<br />
Sep. 2024.<br /></li>
<li><span class="underline">Takaaki Fukai</span>, Kento Sato and Takahiro Hirofuchi.<br />
<b>Analyzing I/O Performance of a Hierarchical HPC Storage System for Distributed Deep Learning</b><br />
In Proceedings of the 23rd International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT’22)<br />
Dec 2022.<br /></li>

<li>Tabuchi, Akihiro and Shirahata, Koichi and Yamazaki, Masafumi and Kasagi, Akihiko and Honda, Takumi and Kurihara, Kouji and Kawakami, Kentaro and Tabaru, Tsuguchika and Fukumoto, Naoto and Kuroda, Akiyoshi and <span class="underline">Fukai, Takaaki</span> and Sato, Kento<br />
<b>The 16,384-node Parallelism of 3D-CNN Training on An Arm CPU based Supercomputer</b><br />
2021 IEEE 28th International Conference on High Performance Computing, Data, and Analytics (HiPC)<br />
Dec. 2021.<br /></li>

<li>Masanori Misono, Masahiro Ogino, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>FaultVisor2: Testing Hypervisor Device Drivers against Real Hardware Failures.</b><br />
In Proceedings of the 10th IEEE International Conference on Cloud Computing Technology and Science (CloudCom 2018),<br />
Dec. 2018. (Acceptance Ratio: 19.8%) <b>[Best paper award]</b>.<br /></li>

<li>Iori Yoneji, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa and Kazuhiko Kato.<br />
<b>Unified Hardware Abstraction Layer with Device Masquerade.</b><br />
In Proceedings of the 33rd ACM Symposium On Applied Computing (ACM SAC 2018),<br />
Apr. 2018 (To appear).<br /></li>

<li><span class="underline">Takaaki Fukai</span>, Satoru Takekoshi, Kohei Azuma, Takahiro Shinagawa and Kazuhiko Kato.<br />
<b>BMCArmor: A Hardware Protection Scheme for Bare-Metal Clouds.</b><br />
In Proceedings of the 9th IEEE International Conference on Cloud Computing Technology and Science (CloudCom 2017),<br />
Dec. 2017.<br /></li>

<li><span class="underline">Takaaki Fukai</span>, Yushi Omote, Takahiro Shinagawa, and Kazuhiko Kato.<br />
<b>OS-Independent Live Migration Scheme for Bare-metal Clouds.</b><br />
In Proceedings of the 8th IEEE/ACM International Conference on Utility and Cloud Computing (UCC 2015),<br />
Dec. 2015.<br />
<b>[Best paper award]</b>.<br /></li>
</ol>
</div>
</li>
