profile_jp.org
** 国際ワークショップ
   1. _Takaaki Fukai_, Manami Mori, Ryuichi Sakamoto, Takahiro Hirofuchi, Takuya Asaka.
      *A Thin Hypervisor Approach to Multi-Tenant SmartNICs in Edge Data Centers.*
      Proceedings of the 8th International Workshop on Edge Systems, Analytics and Networking,
      Mar. 2025.
   2. Farrell, Steven and Emani, Murali and Balma, Jacob and Drescher, Lukas and Drozd, Aleksandr and Fink, Andreas and Fox, Geoffrey and Kanter, David and Kurth, Thorsten and Mattson, Peter and Mu, Dawei and Ruhela, Amit and Sato, Kento and Shirahata, Koichi and Tabaru, Tsuguchika and Tsaris, Aristeidis and Balewski, Jan and Cumming, Ben and Danjo, Takumi and Domke, Jens and _Fukai, Takaaki_ and Fukumoto, Naoto and Fukushi, Tatsuya and Gerofi, Balazs and Honda, Takumi and Imamura, Toshiyuki and Kasagi, Akihiko and Kawakami, Kentaro and Kudo, Shuhei and Kuroda, Akiyoshi and Martinasso, Maxime and Matsuoka, Satoshi and Mendon\ccedil{}a, Henrique and Minami, Kazuki and Ram, Prabhat and Sawada, Takashi and Shankar, Mallikarjun and John, Tom St. and Tabuchi, Akihiro and Vishwanath, Venkatram and Wahib, Mohamed and Yamazaki, Masafumi and Yin, Junqi.
      *MLPerf\trade{} HPC: A Holistic Benchmark Suite for Scientific Machine Learning on HPC Systems.*
      2021 IEEE/ACM Workshop on Machine Learning in High Performance Computing Environments (MLHPC).
      November 2021.
   3. Ilias Avramidis, Michael Mackay, Posco Tso, _Takaaki Fukai_, Takahiro Shinagawa.
      *Live Migration on ARM-based Micro-datacentres.*
      In Proceedings of the 3rd Workshop on Edge Computing (EdgeCom 2018),
      Jan. 2018.

** 国内研究会

   1. 大野 健太朗, 宮島 敬明, _深井 貴明_ ．
      *異種Armプロセッサにおける軽量ハイパバイザによる性能への影響の比較と分析．*
      第169回 システムソフトウェアとオペレーティング・システム研究会．
      2025年9月．
   2. 広渕 崇宏, アクラム ベン アーメッド, _深井 貴明_.
      *Asynchronous Traffic Shaping (ATS)に対応したTime-sensitive network (TSN)エンドポイントの試作*
      電子情報通信学会 信学技報, vol. 124, no. 438, CPSY2024-58, pp. 79-84.
      2025年3月.
   3. 宮川 大輝, _深井 貴明_, 李 彦志, 広渕 崇宏, 菅谷 みどり．
      *ベアメタル環境におけるSmartNICを用いたOSイメージ展開手法の設計と実装．*
      第166回 システムソフトウェアとオペレーティング・システム研究会．
      2025年3月．
   4. Akram Ben Ahmed, Takahiro Hirofuchi, _Takaaki Fukai_.
      *Preliminary Report on an FPGA-based Prototype of a Network Switch Supporting Asynchronous Traffic Shaping for Time Sensitive Networking*
      電子情報通信学会 信学技報, vol. 124, no. 74, RECONF2024-5, pp. 23-29.
      2024年6月.
   5. 飯田 圭祐(†), _深井 貴明_, 広渕 崇宏, 松谷 健史．
      *軽量ハイパバイザのSR-IOVデバイス制御における性能劣化削減手法．*
      第163回 システムソフトウェアとオペレーティング・システム研究会．
      2024年5月．
      †: *Outstanding Presentation Award*
   6. 相馬 大地, 石黒 健太, _深井 貴明_, 広渕 崇宏, 河野 健二．
      *資源集約時における低遅延通信のためのSmartNICを活用したスケジューリング支援．*
      第163回 システムソフトウェアとオペレーティング・システム研究会．
      2024年5月．
   7. Akram Ben Ahmed, Takahiro Hirofuchi, _Takaaki Fukai_.
      *Implementation and Preliminary Evaluation of an FPGA-based Network Switch Supporting Credit-based Shaper for Time Sensitive Networks.*
      電子情報通信学会 信学技報, vol. 124, no. 2, NS2024-11, pp. 47-52.
      2024年4月.
   8. 中井 樹, _深井 貴明_, 広渕 崇宏, 佐藤 幸紀．
      *メモリ暗号化されたクラウドシステム基盤の性能評価．*
      電子情報通信学会 信学技報, vol. 123, no. 450, CPSY2023-50, pp. 71-76．
      (組込み技術とネットワークに関するワークショップ ETNET2024)
      2024年3月．
   9. 森 真誠, _深井 貴明_, 広渕 崇宏, 朝香 卓也．
      *I/Oデバイス内部の汎用プロセッサにおける軽量な隔離実行環境．*
      第162回 システムソフトウェアとオペレーティング・システム研究会．
      2024年2月．
   10. 石井 玲真(†), _深井 貴明_, 品川 高廣．
       *ネステッド仮想化のファジングにおけるカバレッジ向上に向けて．*
       第159回 システムソフトウェアとオペレーティング・システム研究会．
       2023年5月．
       †: *Outstanding Presentation Award*
   11. 葛野 弘樹, _深井 貴明_ ．
       *新規仮想化ソフトウェアのセキュア実装に向けた既存実装の脆弱性分類の検討．*
       情報処理学会 第85回全国大会講演論文集，
       2023年2月．
   12. 森 真誠(†), _深井 貴明_, 山本 啓二, 広渕 崇宏, 朝香 卓也．
       *Root権限使用可能なArmスパコン実現に向けた軽量ハイパバイザの設計と実装．*
       第157回 システムソフトウェアとオペレーティング・システム研究会．
       2022年9月．
       †: *最優秀若手発表賞 受賞*

   13. 長塚 向紀, _深井 貴明_, 山本 啓二, 宮島 敬明, 広渕 崇宏． 
       *Armプロセッサにおける軽量ハイパバイザの性能評価．*
       第157回 システムソフトウェアとオペレーティング・システム研究会．
       2022年9月．

   14. _深井 貴明_, 広渕 崇宏, 高野 了成, Akram Ben Ahmed, 佐藤 賢斗．
       *FPGAによる次世代メモリのエミュレーション機構．*
       第180回 ハイパフォーマンスコンピューティング研究発表会 (SWoPP2021)
       2021年7月．

   15. 荻野 将拓, 味曽野 雅史, _深井 貴明_, 品川 高廣．
       *ハードウェア障害に対するハイパーバイザの対故障性検証．*
       第143回 システムソフトウェアとオペレーティング・システム研究会．
       2018年5月．

   16. 東 耕平, 竹腰 開, _深井 貴明_, 品川 高廣, 加藤 和彦
      *ベアメタルクラウドにおけるハードウェア保護．*
      第136回 システムソフトウェアとオペレーティング・システム研究会．
      2016年2月．

   17. _深井 貴明_ ，表 祐志，品川 高廣，加藤 和彦．
      *物理マシン間のライブマイグレーション手法の提案．*
      第127回 システムソフトウェアとオペレーティング・システム研究会．
      2013年12月．
     [[./files/OS127-fukai.pdf][PDF]] [[./ipsjnotice.html][ここに掲載した著作物の利用に関する注意]]

