docs/profile_jp.html

<li><a id="org5d61796"></a>国際ポスタ発表<br />
<div class="outline-text-3" id="text-org5d61796">
<ol class="org-ol">
<li>Yoshifumi Shu, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>Coverage-Based Debloating of Linux Kernel Configurations for Real Machine Environments.</b><br />
The 31st Symposium on Operating Systems Principles (SOSP 2025).<br />
Oct. 2025.<br /></li>

<li><span class="underline">Takaaki Fukai</span>, Manami Mori, Keiji Yamamoto, Takahiro Hirofuchi, Takuya Asaka.<br />
<b>Toward Providing Root Privilege to Flagship HPC Users with Thin-Hypervisor.</b><br />
2024 IEEE International Conference on Cluster Computing Workshops (CLUSTER Workshops),<br />
Sep. 2024.<br /></li>

<li>Itsuki Nakai, <span class="underline">Takaaki Fukai</span>, Takahiro Hirofuchi, Yukinori Sato.<br />
<b>Performance Evaluation of Confidential Containers in the Edge-Cloud Computing Continuum.</b><br />
15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br />
Sep. 2024.<br /></li>

<li>Taiki Miyakawa, <span class="underline">Takaaki Fukai</span>, Li Yanzhi, Takahiro Hirofuchi, Midori Sugaya.<br />
<b>Toward Optimizing OS Image Deployment Using SmartNIC.</b><br />
15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br />
Sep. 2024.<br /></li>

<li>Manami Mori, <span class="underline">Takaaki Fukai</span>, Ryuichi Sakamoto, Takahiro Hirofuchi, Takuya Asaka.<br />
<b>A lightweight isolated execution environment in SmartNIC.</b><br />
15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br />
Sep. 2024.<br /></li>

<li>Keisuke Iida, <span class="underline">Takaaki Fukai</span>, Takahiro Hirofuchi, Takeshi Matsuya.<br />
<b>Design of SR-IOV Driver to Mitigate Performance Degradation for Lightweight Hypervisor.</b><br />
15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br />
Sep. 2024.<br /></li>

<li>Reima Ishii, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
<b>Toward Efficient Fuzzing of Nested Virtualization.</b><br />
17th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2023).<br />
Jul. 2023.<br /></li>

<li><span class="underline">Takaaki Fukai</span> and Kento Sato.<br />
<b>Measurement of I/O Performance on a Hierarchical File System for Distributed Deep Neural Network.</b><br />
The 4th R-CCS International symposium<br />
February, 2022.<br /></li>

<li><span class="underline">Takaaki Fukai</span> and Kento Sato.<br />
<b>Performance Measurement of a Hierarchical File System for Distributed Deep Neural Network Training.</b><br />
The International Conference on High Performance Computing in Asia-Pacific Region (HPC Asia 2022)<br />
January, 2022.<br /></li>

<li><span class="underline">Takaaki Fukai</span> and Kento Sato.<br />
<b>Measurement of I/O performance for distributed deep neural networks on Fugaku</b>.<br />
The 3rd R-CCS International Symposium 2021.<br />
February, 2021.<br /></li>

<li>Ryosuke Yasuoka, <span class="underline">Takaaki Fukai</span> and Takahiro Shinagawa.<br />
<b>Toward On-demand Nested Virtualization for Live-Refreshing Cloud Systems</b>.<br />
The Fifteenth EuroSys Conference 2020 (EuroSys ’20).<br />
April, 2020.<br /></li>

<li><span class="underline">Takaaki Fukai</span>, Yushi Omote, Takahiro Shinagawa, and Kazuhiko Kato.<br />
<b>Live Migration of Bare-metal Instances</b><br />
5th Asia-Pacific Workshop on Systems (APSys 2014).<br />
June, 2014<br /></li>
</ol>
</div>
</li>

<li><a id="orgd221a18"></a>国内ポスタ発表<br />
<div class="outline-text-3" id="text-orgd221a18">
<ol class="org-ol">
<li>藤井 大悟, 広渕 崇宏, <span class="underline">深井 貴明</span> ．<br />
<b>ハードウェアフレームジェネレータを用いたLinuxサーバのレイテンシ分析．</b><br />
第37回コンピュータシステム・シンポジウム (ComSys 2025).<br />
2025年12月.<br /></li>
<li>大野 健太朗, 宮島 敬明, <span class="underline">深井 貴明</span> ．<br />
<b>異種Armプロセッサにおける軽量ハイパバイザによる性能劣化特性の比較．</b><br />
xSIG 2024．<br />
2024年8月．<br /></li>
<li>広渕 崇宏, Akram Ben Ahmed, <span class="underline">深井 貴明</span>, 加藤 丈治, 高野 了成．<br />
<b>ポスト5Gを支える時間確定的なコンピューティング基盤技術の開発にむけて．</b><br />
xSIG 2024．<br />
2024年8月．<br /></li>
<li>Akram BEN AHMED, Takahiro HIROFUCHI, <span class="underline">Takaaki FUKAI</span>.<br />
<b>Towards Open-source FPGA-based hardware support for Time Sensitive Networks.</b><br />
xSIG 2024．<br />
2024年8月．<br /></li>
<li>Akram BEN AHMED, Takahiro HIROFUCHI, <span class="underline">Takaaki FUKAI</span>.<br />
<b>A work-in-progress report on FPGA-based hardware support of Credit Based Shaping for Time Sensitive Networks.</b><br />
第248回システム・アーキテクチャ・第205回システムとLSIの設計技術・第65回組込みシステム合同研究発表会（ETNET2024）．<br />
2024年3月．<br /></li>
<li>中井 樹, <span class="underline">深井 貴明</span>, 広渕 崇宏, 佐藤 幸紀．<br />
<b>メモリ暗号化されたクラウドシステム基盤の性能評価．</b><br />
第248回システム・アーキテクチャ・第205回システムとLSIの設計技術・第65回組込みシステム合同研究発表会（ETNET2024）．<br />
2024年3月．<br /></li>
<li>宮川 大輝, <span class="underline">深井 貴明</span>, 李 彦志, 広渕 崇宏, 菅谷みどり．<br />
<b>I/O処理オフロードに向けたSmartNICとCPUのネットワーク性能特性の比較．</b><br />
第35回コンピュータシステム・シンポジウム (ComSys 2023).<br />
2023年12月.<br /></li>
<li>葛野弘樹， <span class="underline">深井貴明</span>.<br />
<b>仮想化ソフトウェアのセキュア化に向けた脆弱性の調査分析.</b><br />
第34回コンピュータシステム・シンポジウム (ComSys 2022).<br />
2022年12月.<br /></li>

<li>安岡 亮輔， <span class="underline">深井 貴明</span> ，品川 高廣， 加藤 和彦.<br />
<b>ネステッド仮想化の動的 ON/OFF による仮想マシンモニタ若化.</b><br />
第28回コンピュータシステム・シンポジウム (ComSys 2016).<br />
2016年11月.<br /></li>

<li><span class="underline">深井 貴明</span> ，表 祐志，品川 高廣，加藤 和彦.<br />
<b>物理マシン間のライブマイグレーション手法の提案.</b><br />
第11回 ディペンダブルシステムワークショップ (DSW 2013).<br />
2013年12月.<br /></li>

<li><span class="underline">深井 貴明</span> ，表 祐志，品川 高廣，加藤 和彦.<br />
<b>物理マシン間のライブマイグレーション手法の提案.</b><br />
第25回コンピュータシステム・シンポジウム (ComSys 2013).<br />
2013年12月.<br /></li>
</ol>
</div>
</li>

<li><a id="org19b4402"></a>招待講演<br />
<div class="outline-text-3" id="text-org19b4402">
<ol class="org-ol">
<li><span class="underline">深井 貴明</span> ．<br />
クラウド、HPC、エッジにおける軽量ハイパバイザの研究<br />
第158回システムソフトウェアとオペレーティング・システム研究会 若手招待講演．<br />
2023年2月<br /></li>
</ol>
</div>
</li>

<li><a id="org6338250"></a>その他国際発表<br />
<div class="outline-text-3" id="text-org6338250">
<ol class="org-ol">
<li>Satoru Takekoshi, Manami Mori, <span class="underline">Takaaki Fukai</span>, Takahiro Shinagawa.<br />
AML Injection Attacks on Confidential VMs<br />
BlackHat EU 2024.<br />
Dec. 2024.<br />
<a href="https://blackhat.com/eu-24/briefings/schedule/#aml-injection-attacks-on-confidential-vms-42723">https://blackhat.com/eu-24/briefings/schedule/#aml-injection-attacks-on-confidential-vms-42723</a><br /></li>
</ol>
</div>
</li>

<li><a id="orgf81b66a"></a>その他国内発表<br />
<div class="outline-text-3" id="text-orgf81b66a">
<ol class="org-ol">
<li><span class="underline">深井 貴明</span><br />
トップカンファレンス・ジャーナル採択論文講演<br />
(採択論文情報: Takaaki Fukai, Takahiro Shinagawa, Kazuhiko Kato, "Live Migration in Bare-metal Clouds", IEEE Transactions on Cloud Computing, July 2018.)<br />
第31回コンピュータシステム・シンポジウム (ComSys2019）<br /></li>
</ol>
</div>
</li>

<li><a id="orgf2a2722"></a>学位論文<br />
<div class="outline-text-3" id="text-orgf2a2722">
<ul class="org-ul">
<li><span class="underline">深井貴明</span><br />
<b>ベアメタルクラウドにおける物理マシン管理に関する研究</b><br />
 筑波大学 システム情報工学研究科 博士論文<br />
2018年9月<br /></li>
<li><span class="underline">深井貴明</span><br />
<b>物理マシン間のOSライブマイグレーションに関する研究</b><br />
筑波大学大学院システム情報工学研究科コンピュータサイエンス専攻 修士論文<br />
2015年3月<br /></li>
<li><span class="underline">深井貴明</span><br />
<b>Mintオペレーティングにおける柔軟な起動順序の実現</b><br />
岡山大学工学部情報工学科 卒業研究報告書<br />
2013年3月<br /></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgc918bdb" class="outline-2">
<h2 id="orgc918bdb">受賞歴</h2>
<div class="outline-text-2" id="text-orgc918bdb">
<ol class="org-ol">
<li><b>Distinguished Paper Award</b><br />
ACM SIGSAC Conference on Computer and Communications Security (CCS 2025)<br /></li>

<li><b>IEEE Computer Society Japan Chapter Young Author Award 2019</b><br />
IEEE Computer Society Tokyo/Japan Joint Chapter, 2019年12月<br /></li>

<li><b>Best Paper Award</b><br />
The 10th IEEE International Conference on Cloud Computing Technology and Science, December 2018<br /></li>

<li><b>Best Paper Award</b><br />
The 8th IEEE/ACM International Conference on Utility and Cloud Computing, December 2015<br /></li>

<li><b>岡山大学工学部優秀学生賞</b><br />
岡山大学工学部 2013年3月<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orge8b5ba5" class="outline-2">
<h2 id="orge8b5ba5">研究資金獲得歴</h2>
<div class="outline-text-2" id="text-orge8b5ba5">
</div>
<ul class="org-ul">
<li><a id="orgab5766e"></a>研究代表者<br />
<div class="outline-text-3" id="text-orgab5766e">
<ul class="org-ul">
<li>2021年度&#x2013;2024年度 日本学術振興会 科学研究費助成事業(科研費) 若手研究　「共用 HPC における管理者権限の利用を許す計算資源提供」<br /></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb81a2b2" class="outline-2">
<h2 id="orgb81a2b2">学会活動</h2>
<div class="outline-text-2" id="text-orgb81a2b2">
</div>
<ul class="org-ul">
<li><a id="org79ac334"></a>編集委員<br />
<div class="outline-text-3" id="text-org79ac334">
<ul class="org-ul">
<li>情報処理学会論文誌：コンピューティングシステム 編集委員 (2025年4月&#x2013;現在)<br /></li>
<li>情報処理学会 会誌編集委員会 専門委員会 システム分野 委員 (2022年4月&#x2013;2026年3月)<br /></li>
<li>情報処理学会論文誌：コンピューティングシステム 編集委員 (2020年4月&#x2013;2024年3月)<br /></li>
</ul>
</div>
</li>

<li><a id="orgd67c288"></a>運営委員<br />
<div class="outline-text-3" id="text-orgd67c288">
<ul class="org-ul">
<li>情報処理学会 システムソフトウェアとオペレーティングシステム研究会 幹事 (2024年4月&#x2013;現在)<br /></li>
<li>情報処理学会 システムソフトウェアとオペレーティングシステム研究会 委員 (2020年4月&#x2013;2024年3月)<br /></li>
</ul>
</div>
</li>
