profile_jp.org
** その他
- Sponsor Chair. 15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).
- Online arrangement chair. The 3rd R-CCS International Symposium 2021.

* その他学外活動
  - ResearchGate :: https://www.researchgate.net/profile/Takaaki_Fukai
  - Linkedin :: https://www.linkedin.com/in/takaaki-fukai-b378a7141/?originalSubdomain=jp
  - Slideshare :: https://www.slideshare.net/DeepTokikane/presentations
  - Github :: https://github.com/fukai-t
  - Bitbucket :: https://bitbucket.org/ftakaaki/

* 更新履歴

  - 2026/03/09 /所属/, /業績/, /学会活動/, /職歴/ の更新
  - 2022/12/29 /所属/, /連絡先/, /職歴/, /業績/ の更新
  - 2021/09/10 /研究資金獲得歴/, /学会活動/ を追加, /業績/, /職歴/ の更新
  - 2020/04/07 /業績/ の更新
  - 2020/03/10 /職歴/ の追加, /所属/, /連絡先/, /業績/, /受賞歴/ の更新
  - 2019/08/12 所属, 連絡先, 学歴, 業績, 受賞歴, その他活動を更新
  - 2019/08/11 本ページを http://www.osss.cs.tsukuba.ac.jp/~fukai から https://fukai-t.github.io/profile-page/ へ移動
  - 2018/02/14 所属(学年)，研究分野，業績を更新
  - 2017/01/14 連絡先，業績一覧を更新，その他学外活動を追加
  - 2016/03/14 業績一覧を更新
  - 2015/12/11 英語版のページを追加 & 業績，研究分野を更新 &  受賞歴を追加
  - 2015/05/09 所属，学歴，業績を更新
  - 2014/03/12 ページ公開

