docs/profile_jp.html
<li><a id="org491b07b"></a>その他<br />
<div class="outline-text-3" id="text-org491b07b">
<ul class="org-ul">
<li>Sponsor Chair. 15th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2024).<br /></li>
<li>Online arrangement chair. The 3rd R-CCS International Symposium 2021.<br /></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org3b9852c" class="outline-2">
<h2 id="org3b9852c">その他学外活動</h2>
<div class="outline-text-2" id="text-org3b9852c">
<dl class="org-dl">
<dt>ResearchGate</dt><dd><a href="https://www.researchgate.net/profile/Takaaki_Fukai">https://www.researchgate.net/profile/Takaaki_Fukai</a><br /></dd>
<dt>Linkedin</dt><dd><a href="https://www.linkedin.com/in/takaaki-fukai-b378a7141/?originalSubdomain=jp">https://www.linkedin.com/in/takaaki-fukai-b378a7141/?originalSubdomain=jp</a><br /></dd>
<dt>Slideshare</dt><dd><a href="https://www.slideshare.net/DeepTokikane/presentations">https://www.slideshare.net/DeepTokikane/presentations</a><br /></dd>
<dt>Github</dt><dd><a href="https://github.com/fukai-t">https://github.com/fukai-t</a><br /></dd>
<dt>Bitbucket</dt><dd><a href="https://bitbucket.org/ftakaaki/">https://bitbucket.org/ftakaaki/</a><br /></dd>
</dl>
</div>
</div>

<div id="outline-container-orga72eae0" class="outline-2">
<h2 id="orga72eae0">更新履歴</h2>
<div class="outline-text-2" id="text-orga72eae0">
<ul class="org-ul">
<li>2026/03/09 <i>所属</i>, <i>業績</i>, <i>学会活動</i>, <i>職歴</i> の更新<br /></li>
<li>2022/12/29 <i>所属</i>, <i>連絡先</i>, <i>職歴</i>, <i>業績</i> の更新<br /></li>
<li>2021/09/10 <i>研究資金獲得歴</i>, <i>学会活動</i> を追加, <i>業績</i>, <i>職歴</i> の更新<br /></li>
<li>2020/04/07 <i>業績</i> の更新<br /></li>
<li>2020/03/10 <i>職歴</i> の追加, <i>所属</i>, <i>連絡先</i>, <i>業績</i>, <i>受賞歴</i> の更新<br /></li>
<li>2019/08/12 所属, 連絡先, 学歴, 業績, 受賞歴, その他活動を更新<br /></li>
<li>2019/08/11 本ページを <a href="http://www.osss.cs.tsukuba.ac.jp/~fukai">http://www.osss.cs.tsukuba.ac.jp/~fukai</a> から <a href="https://fukai-t.github.io/profile-page/">https://fukai-t.github.io/profile-page/</a> へ移動<br /></li>
<li>2018/02/14 所属(学年)，研究分野，業績を更新<br /></li>
<li>2017/01/14 連絡先，業績一覧を更新，その他学外活動を追加<br /></li>
<li>2016/03/14 業績一覧を更新<br /></li>
<li>2015/12/11 英語版のページを追加 &amp; 業績，研究分野を更新 &amp;  受賞歴を追加<br /></li>
<li>2015/05/09 所属，学歴，業績を更新<br /></li>
<li>2014/03/12 ページ公開<br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 深井貴明</p>
<p class="date">Created: 2026-03-09 Mon 21:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
